## 
## Cadence bgx_shell "v5.17-s013 (Feb  5 2007 03:22:26)"
## Sun May  3 21:01:01 2009
## 
## sdc_write_unambiguous_names global on
## 
set sdc_version 1.4

create_clock [get_ports {blif_clk_net}]  -name vclk -period 0.692521 -waveform {0 0.34626}
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g40}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g40}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g563}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g563}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g41}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g41}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g564}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g564}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g557}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g557}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g301}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g301}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g42}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g42}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g705}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g705}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g558}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g558}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {blif_clk_net}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {blif_clk_net}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g36}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g36}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g559}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g559}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g310}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g310}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g44}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g44}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g37}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g37}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g567}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g567}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g38}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g38}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g45}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g45}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g46}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g46}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g39}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g39}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g639}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g639}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g306}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g306}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g47}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g47}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g314}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g314}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g319}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g319}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g94}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g94}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g89}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g89}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g102}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g102}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g98}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g98}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g107}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g107}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g22}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g22}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g23}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g23}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g560}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g560}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g561}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g561}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g32}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g32}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g702}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g702}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {g562}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {g562}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -min -pin Y -from_pin A [get_ports {blif_reset_net}]
set_driving_cell -lib_cell INVX8 -library gscl45nm -no_design_rule -max -pin Y -from_pin A [get_ports {blif_reset_net}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g41}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g561}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g319}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g306}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g702}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g42}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g562}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g89}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g22}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {blif_reset_net}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g639}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g314}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g36}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g563}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g301}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g23}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g107}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g44}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g37}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g564}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g557}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g98}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g38}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g45}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g705}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g558}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g310}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g102}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g32}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g46}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g39}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g559}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g40}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g560}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g94}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g47}]
set_input_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g567}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4098}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6284}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4100}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6362}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4099}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4101}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6370}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g5468}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4102}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4103}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4110}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g3222}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6364}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g5469}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4104}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6372}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g5137}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6728}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6366}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g3600}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4112}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4105}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6374}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4106}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6368}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4809}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4121}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4107}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g1290}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4108}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4422}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4109}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g2584}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g1293}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g5692}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6282}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g6360}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4307}]
set_output_delay -add_delay -9999 -clock [get_clocks {vclk}] [get_ports {g4321}]
set_false_path  -from [get_ports {blif_reset_net}] 
